emacs/configs/documentation/01-general.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1"><link rel="stylesheet" href="/assets/styles/style.css"><link rel="stylesheet" href="/assets/styles/toc-sidebar.css"></head>
<body>
<main id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org453d901">1. General Documentation Configuration</a>
<ul>
<li><a href="#orgf265342">1.1. Overview</a></li>
<li><a href="#org33f8622">1.2. What's Included</a></li>
<li><a href="#org526669d">1.3. General</a></li>
</ul>
</li>
<li><a href="#orge1b25aa">2. End of File</a></li>
</ul>
</div>
</div>
<div id="outline-container-org453d901" class="outline-2">
<h2 id="org453d901"><span class="section-number-2">1.</span> General Documentation Configuration</h2>
<div class="outline-text-2" id="text-1">
<p>
Common documentation tools and utilities that apply across all document formats (Org-mode, Markdown, etc.).
</p>
</div>

<div id="outline-container-orgf265342" class="outline-3">
<h3 id="orgf265342"><span class="section-number-3">1.1.</span> Overview</h3>
<div class="outline-text-3" id="text-1-1">
<p>
This module provides:
</p>
<ul class="org-ul">
<li><b><b>Distraction-Free Writing</b></b>: Olivetti for centered, focused writing</li>
<li><b><b>Reading Experience</b></b>: Enhanced typography and visual comfort</li>
</ul>
</div>
</div>

<div id="outline-container-org33f8622" class="outline-3">
<h3 id="org33f8622"><span class="section-number-3">1.2.</span> What's Included</h3>
<div class="outline-text-3" id="text-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Category</th>
<th scope="col" class="org-left">Tools</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Distraction-Free Mode</td>
<td class="org-left">olivetti</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org526669d" class="outline-3">
<h3 id="org526669d"><span class="section-number-3">1.3.</span> General</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">doc-general-conf.el --- General documentation configuration -*- lexical-binding: t; -*-
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">General documentation tools: distraction-free writing and utilities
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">that apply across all document formats.
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Distraction-Free Writing
</span>(<span class="org-keyword">use-package</span> olivetti
  <span class="org-builtin">:bind</span> (<span class="org-string">"&lt;f9&gt;"</span> . olivetti-mode) <span class="org-comment-delimiter">;; </span><span class="org-comment">Toggle with F9
</span>  <span class="org-builtin">:custom</span>
  (olivetti-body-width 80)       <span class="org-comment-delimiter">;; </span><span class="org-comment">Set width to 80 chars
</span>  (olivetti-recall-visual-line-mode-entry-state t))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge1b25aa" class="outline-2">
<h2 id="orge1b25aa"><span class="section-number-2">2.</span> End of File</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">doc-general-conf</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">doc-general-conf.el ends here</span>
</pre>
</div>
</div>
</div>
</main>
</body>
</html>
